using System;

namespace _02._Hospital
{
    class Program
    {
        static void Main(string[] args)
        {
            //За даден период от време, всеки ден в болницата пристигат пациенти за преглед. Тя разполага първоначално със 7 лекари.
            //Всеки лекар може да преглежда само по един пациент на ден, но понякога има недостиг на лекари,
            // затова останалите пациенти се изпращат в други болници.
            // Всеки трети ден, болницата прави изчисления и ако броят на непрегледаните пациенти е по - голям от броя на прегледаните,
            //  се назначава още един лекар. Като назначаването става преди да започне приемът на пациенти за деня.
            //  Напишете програма, която изчислява за дадения период броя на прегледаните и непрегледаните пациенти.
            //Вход
            //Входът се чете от конзолата и съдържа:
            //•	На първия ред – периода, за който трябва да направите изчисления. Цяло число в интервала[1... 1000]
            //•	На следващите редове(равни на броят на дните) – броя пациенти, които пристигат за преглед за текущия ден. Цяло число в интервала[0…10 000]
            //Изход
            //Да се отпечатат на конзолата 2 реда:
            //•	На първия ред: "Treated patients: {брой прегледани пациенти}."
            //•	На втория ред: "Untreated patients: {брой непрегледани пациенти}."

            // 1 ден: 7 прегледани и 0 непрегледани пациента за деня
            //2 ден: 7 прегледани и 20 непрегледани пациента за деня
            //3 ден: До момента прегледаните пациенти са общо 14, а непрегледаните – 20 –> Назначава се нов лекар –>
            //8 прегледани и 1 непрегледан пациент за деня
            //4 ден: 1 прегледан и 0 непрегледани пациента за деня
            //Общо: 23 прегледани и 21 непрегледани пациенти.
            int day = int.Parse(Console.ReadLine());
            int doktors = 7;
           
            int pacientOk = 0;
            int pacientGo = 0;
            for (int i = 1; i <= day; i++)
            {
                int numPacient = int.Parse(Console.ReadLine());
                if (i % 3 == 0)
                {
                    if (pacientOk - pacientGo < 0)
                    {
                        doktors++;
                    }
                }
                if (numPacient > doktors)
                {
                    pacientOk += doktors;
                    pacientGo += numPacient - doktors;
                }
                else
                {
                    pacientOk += numPacient;
                }
            }
            
        Console.WriteLine($"Treated patients: {pacientOk}.");
            Console.WriteLine($"Untreated patients: {pacientGo}.");
        }
    }
}
