using System;

namespace Rage_Expenses
{
    class Program
    {
        static void Main(string[] args)
        {
            //Като играч на MOBA претендент, Петър има лошия навик да изхвърля компютъра си, когато загуби игра и яростта престане.Игровата му настройка се състои от слушалки, мишка, клавиатура и дисплей.Ще получите броя на загубените игри на Петър.
            //При всяка втора загубена игра Петър разхвърля слушалките си.
            //При всяка трета загубена игра Петър хвърля мишката си.
            //Когато Петър изхвърля и мишката, и слушалките си в една и съща загубена игра, той изхвърля и клавиатурата си.
            //Всеки втори път, когато изхвърля клавиатурата си, той изхвърля и дисплея си.
            //Ще получите цената на всеки артикул в неговата игрална настройка. Изчислете разходите му за ярост за подновяване на игралното му оборудване.
            //Вход / Ограничения
            //• На първия входен ред -брой загубени игри – цяло число в диапазона[0, 1000].
            //• На втория ред – цена на слушалките – число с плаваща запетая в диапазон[0, 1000].
            //• На третия ред – цена на мишката - число с плаваща запетая в диапазон[0, 1000].
            //• На четвъртия ред – цена на клавиатурата – число с плаваща запетая в диапазон[0, 1000].
            //• На петия ред – показване на цената – число с плаваща запетая в диапазон[0, 1000].
            //Изход
            //• Като изход трябва да отпечатате общите разходи на Петър: "Разходи за ярост: {разходи} лв."
            //• Разрешено работно време / памет: 100ms / 16MB.
            int numGameLost = int.Parse(Console.ReadLine());
            double priceHeadphones = double.Parse(Console.ReadLine());
            double priceMouse = double.Parse(Console.ReadLine());
            double priceKeybord = double.Parse(Console.ReadLine());
            double priceDisplay = double.Parse(Console.ReadLine());
            double total = 0;
            for (int i = 1; i <= numGameLost; i++)
            {


                if (i % 2 == 0)
                {
                    total += priceHeadphones;
                }
                if (i % 3 == 0)
                {
                    total += priceMouse;
                }
                if (i % 6 == 0)
                {
                    total += priceKeybord;
                }
                if (i % 12 == 0)
                {
                    total += priceDisplay;

                }
            }
            Console.WriteLine($"Rage expenses: {total:f2} lv.");
        }
    }
}
