using System;

namespace Художествена_гимнастика
{
    class Program
    {
        static void Main(string[] args)
        {
            //На световно първенство по художествена гимнастика три от държавите се изявяват като лидери в класирането(Русия, България, Италия).
            //Вашата задача е да изчислите каква е оценката дадена от журито за конкретно съчетание, като знаете държавата,
            //която е играла и с кой уред е играла - лента, обръч или въже.
            //За съчетанието си, отбора е получил две оценки: оценка за трудност и оценка за изпълнение на съчетанието,
            //като крайната оценка е сбор на двете оценки. В таблицата са показани какви оценки за трудност и изпълнение са
            //получили ансамблите за всеки един уред.


            //Напишете програма, която изчислява каква е оценката на дадена държава за определен уред и колко процента не им достигат, за да имат максималната оценка, която е 20.
            //Вход
            //Входът се чете от конзолата и се състои от два реда:
            //•	Първи ред – държава – текст("Russia", "Bulgaria" или "Italy")
            //•	Втори ред – уред - текст("ribbon", "hoop" или "rope")
            //Изход
            //На конзолата трябва да се отпечатат два реда:
            //•	Първи ред: "The team of {държава} get {обща оценка} on {уред}."
            //•	Втори ред:  "{процентът, който не им достига до максималния брой точки}%"
            //Общата оценка да бъде форматирана до третата цифра след десетичния знак, а процентът да бъде форматиран до втората цифра след десетичния знак.
            string country = Console.ReadLine();
            string device = Console.ReadLine();
            double points = 0;
            double maxPoints = 20; 
            switch (country)
            {
                case "Russia":
                    if (device== "ribbon")
                    {
                        points = 9.1 + 9.4;
                    }
                   else if (device == "hoop")
                    {
                        points = 9.3 + 9.8;
                    }
                    else if (device== "rope")
                    {
                        points = 9.6 + 9;
                    }
                    break;
                case "Bulgaria":
                    if (device == "ribbon")
                    {
                        points = 9.6 + 9.4;
                    }
                    else if (device == "hoop")
                    {
                        points = 9.55 + 9.75;
                    }
                    else if (device == "rope")
                    {
                        points = 9.5 + 9.4;
                    }
                    break;
                case "Italy":
                    if (device == "ribbon")
                    {
                        points = 9.2 + 9.5;
                    }
                    else if (device == "hoop")
                    {
                        points = 9.45 + 9.35;
                    }
                    else if (device == "rope")
                    {
                        points = 9.7 + 9.15;
                    }
                    break;
            }
            maxPoints -= points;
            double percent = (maxPoints / 20) * 100;
            Console.WriteLine($"The team of {country} get {points:f3} on {device}.");
            Console.WriteLine($"{percent:f2}%");
        }
    }
}
