using System;

namespace Game_Number_Wars
{
    class Program
    {
        static void Main(string[] args)
        {
            //"Numbers" е нова игра, която се играе с 36 карти(двойки, тройки, четворки, петици, шестици, седмици, осмици, деветки и десетки от всички 4 бои).
            //Правилата на играта са следните:
            //	Играе се от двама играчи, които започват с равен брой карти
            //	На всяко раздаване всеки един от тях дава по 1 карта:
            //            o Ако картата на първия играч е с по - голяма стойност от картата на втория играч, първият получава точки,
            //            които са равни на разликата между картата на първия и картата на втория(например: първият дава тройка купа,
            //            а вторият двойка каро->първият печели, защото 3 > 2 и точките, които печели, са 3 – 2 = 1).
            //o Ако картата на втория играч е с по - голяма стойност от картата на първия играч, вторият получава точки,
            //които са равни на разликата между картата на втория и картата на първия(например: вторият дава осмица пика,
            //а първият шестица спатия->вторият печели, защото 8 > 6 и точките, които печели, са 8 – 6 = 2).
            //o Ако картите, които дават двамата, са с еднаква стойност, тогава се получава "Number wars" и всеки един от играчите трябва да даде по още една карта.
            //Играчът, чиято карта е с по - голяма стойност, печели и играта приключва(В този случай, няма да има еднакви карти).
            //	Освен при "Number wars", играта може да приключи и при команда "End of game".Тогава никой не печели и играта приключва.
            //След това, до получаване на команда "End of game", се четат многократно по два реда:
            //1.Карта, която дава първият играч-цяло число в интервала[2…9]
            //2.Карта, която дава вторият играч -цяло число в интервала[2…9]
            //При еднакви карти на двамата играчи се прочитат нови два реда(карта, която дава първият и карта, която дава вторият.)
            //Изход
            //При случая, в който има "Number wars ", да се отпечата:
            //•	"Number wars!"
            //•	"{име на победителя} is winner with {брой натрупани точки} points"
            //При команда "End of game" да се отпечатат два реда:
            //•	"{име на първия играч} has {брой натрупани точки за първия играч} points"
            //•	"{име на втория играч} has {брой натрупани точки за втория играч} points"
            string name1 = Console.ReadLine();
            string name2 = Console.ReadLine();
            string kard1 = Console.ReadLine();
            int point1 = 0;
            int point2 = 0;
            while (kard1 != "End of game")
            {
                int kard = int.Parse(kard1);
                int kard2 = int.Parse(Console.ReadLine());
                if (kard>kard2)
                {
                    point1 += kard - kard2;
                }
                else if (kard<kard2)
                {
                    point2 += kard2 - kard;
                }
                else if (kard == kard2)
                {
                    Console.WriteLine("Number wars!");
                    kard1 = Console.ReadLine();
                    int kardnew = int.Parse(kard1);
                    kard2 = int.Parse(Console.ReadLine());
                    if (kardnew>kard2)
                    {
                        Console.WriteLine($"{name1} is winner with {point1} points");
                    }
                    else
                    {
                        Console.WriteLine($"{name2} is winner with {point2} points");    
                    }
                    return;                   
                }
                kard1 = Console.ReadLine();
            }
            if (kard1== "End of game")
            {
                Console.WriteLine($"{name1} has {point1} points");
                Console.WriteLine($"{name2} has {point2} points");
            }
        }
    }
}
